; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_1 ?v5 - type_2 ?v2 - type_3)
 	      (pred_3 ?v6 - object ?v2 - type_3)
	      (pred_2 ?v5 - type_2 ?v4 - type_1)
	      (pred_4 ?v5 - type_2 ?v6 - object ?v4 - type_1))

   (:action op_3
       :parameters  (?v5 - type_2 ?v1 ?v8 - type_3)
       :precondition (and  (pred_1 ?v5 ?v1))
       :effect (and  (pred_1 ?v5 ?v8)
		     (not (pred_1 ?v5 ?v1))))

   (:action op_1
       :parameters (?v5 - type_2 ?v3 - object ?v7 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_3 ?v3 ?v7) (pred_1 ?v5 ?v7) (pred_2 ?v5 ?v4))
       :effect (and (pred_4 ?v5 ?v3 ?v4)
		    (not (pred_3 ?v3 ?v7)) 
		    (not (pred_2 ?v5 ?v4))))

   (:action op_2
       :parameters (?v5 - type_2 ?v3 - object ?v7 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_4 ?v5 ?v3 ?v4) (pred_1 ?v5 ?v7))
       :effect (and (pred_3 ?v3 ?v7)
		    (pred_2 ?v5 ?v4)
		    (not (pred_4 ?v5 ?v3 ?v4)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_13 obj_10 - type_2
obj_11 obj_02 obj_03 obj_06 - type_1
obj_05 obj_07 obj_04 obj_14 - type_3
obj_09 obj_01 obj_12 obj_08 - object)
(:init
(pred_1 obj_13 obj_14)
(pred_2 obj_13 obj_11)
(pred_2 obj_13 obj_02)
(pred_1 obj_10 obj_07)
(pred_2 obj_10 obj_03)
(pred_2 obj_10 obj_06)
(pred_3 obj_09 obj_07)
(pred_3 obj_01 obj_04)
(pred_3 obj_12 obj_14)
(pred_3 obj_08 obj_05)
)
(:goal
(and
(pred_3 obj_09 obj_05)
(pred_3 obj_01 obj_07)
(pred_3 obj_12 obj_05)
(pred_3 obj_08 obj_14)
)
)

(:constraints
  (always (not (pred_1 obj_13 obj_04)))
)
)

; plan
1. (op_1 obj_10 obj_09 obj_07 obj_06)
   deleted: (pred_3 obj_09 obj_07) (pred_2 obj_10 obj_06)
   added: (pred_4 obj_10 obj_09 obj_06)
   goals met: 0 of 4
2. (op_1 obj_13 obj_12 obj_14 obj_02)
   deleted: (pred_3 obj_12 obj_14) (pred_2 obj_13 obj_02)
   added: (pred_4 obj_13 obj_12 obj_02)
   goals met: 0 of 4
3. (op_3 obj_10 obj_07 obj_05)
   deleted: (pred_1 obj_10 obj_07)
   added: (pred_1 obj_10 obj_05)
   goals met: 0 of 4
4. (op_3 obj_13 obj_14 obj_05)
   deleted: (pred_1 obj_13 obj_14)
   added: (pred_1 obj_13 obj_05)
   goals met: 0 of 4
5. (op_2 obj_10 obj_09 obj_05 obj_06)
   deleted: (pred_4 obj_10 obj_09 obj_06)
   added: (pred_3 obj_09 obj_05) (pred_2 obj_10 obj_06)
   goals met: 1 of 4
6. (op_2 obj_13 obj_12 obj_05 obj_02)
   deleted: (pred_4 obj_13 obj_12 obj_02)
   added: (pred_3 obj_12 obj_05) (pred_2 obj_13 obj_02)
   goals met: 2 of 4
7. (op_1 obj_13 obj_08 obj_05 obj_11)
   deleted: (pred_3 obj_08 obj_05) (pred_2 obj_13 obj_11)
   added: (pred_4 obj_13 obj_08 obj_11)
   goals met: 2 of 4
8. (op_3 obj_13 obj_05 obj_14)
   deleted: (pred_1 obj_13 obj_05)
   added: (pred_1 obj_13 obj_14)
   goals met: 2 of 4
9. (op_3 obj_10 obj_05 obj_04)
   deleted: (pred_1 obj_10 obj_05)
   added: (pred_1 obj_10 obj_04)
   goals met: 2 of 4
10. (op_2 obj_13 obj_08 obj_14 obj_11)
   deleted: (pred_4 obj_13 obj_08 obj_11)
   added: (pred_3 obj_08 obj_14) (pred_2 obj_13 obj_11)
   goals met: 3 of 4
11. (op_1 obj_10 obj_01 obj_04 obj_06)
   deleted: (pred_3 obj_01 obj_04) (pred_2 obj_10 obj_06)
   added: (pred_4 obj_10 obj_01 obj_06)
   goals met: 3 of 4
12. (op_3 obj_10 obj_04 obj_07)
   deleted: (pred_1 obj_10 obj_04)
   added: (pred_1 obj_10 obj_07)
   goals met: 3 of 4
13. (op_2 obj_10 obj_01 obj_07 obj_06)
   deleted: (pred_4 obj_10 obj_01 obj_06)
   added: (pred_3 obj_01 obj_07) (pred_2 obj_10 obj_06)
   goals met: 4 of 4
